#include<iostream>



using namespace std;


int main()
{
    int* A = new int[5];               //  int형 변수 A를 배열 포인터로 선언.


    //  1. 값을 넣어준다. 하나씩 1,2,3,4,5


    for (int i = 0; i < 5; ++i)        // 반복문을 사용하여, 포인터 배열 A에 값을 입력
    {
        A[i] = 1 + i;
    }


    //===================================출력문==================================//

    cout << "      입력 " << "||  주소 값" << endl;
    for (int i = 0; i < 5; ++i)
    {

        cout << "No." << i << " :  " << A[i];
        cout << "  || " << &A[i] << endl;

    }

    cout << "\n 다음 \n\n";
    //=========================================================================//


    //  2. 값을 B로 옮긴다.        

    int* B = new int[6];            //  int형 변수 B를 배열 포인터로 선언.



    for (int i = 0; i < 5; ++i)     //  반복문을 사용하여 포인터 배열 A의 값을 B로 이동.
    {
        B[i] = A[i];
    }


    //===================================출력문==================================//

    cout << "      입력 " << "||  주소 값" << endl;

    for (int i = 0; i < 5; ++i)
    {
        cout << "No." << i << " :  " << B[i];
        cout << "  || " << &B[i] << endl;

    }


    cout << "\n 다음 \n\n";

    //=========================================================================//



    //  3. 새로운 값 하나를 입력 받아서 마지막에 넣어준다.

    for (int i = 0; i < 6; ++i)       //  반복문을 사용하여 포인터 배열 A의 배열을 추가.
    {

        A[i];

    }

    cin >> B[5];


    *A = *B;


    delete A;

    A = B;

    for (int i = 0; i < 6; ++i)
    {

        cout << "Pointers A의 " << i << "번째 값 : " << A[i] << "\n";

    }
    cout << endl;
    B = nullptr;
    delete[] A;

    return 0;

}